know ={
    "السلام عليكم":"وعليكم السلام ",
    "كيف داير":"لاباس الحمد لله",
    "اه":"واخا اسي ميكون غي خاطرك ",
    "لا":"وعلاش",
    "شكون انت":"انا روبو شات و علاش تتسول ",
    "بغيت نعرف":"الفضول مامزيانش اسي",
    "مرحبا":"مرحبا",
    "شحال فعمرك":"يلاه تزاديت ههههه",
    "السلام":"و عليكم السلام",
    "كنبغيك":"حتى أنا كنبغييييييييك",
    "شحال عندك من عام":"يلاه تزاديت ههههه",
    "نسولك":"تفضل",
    "بسلاما":"مسخيتش بك بقى شوية ",
    "شنو":"نلعبو لعبة",
    "تهلا":"عافاك غي بقى شوية ",
    "واخا":"شكرا",
    "كاين شي جديد":"اليوم فقت بكري ",
    "و من بعد":"بقيت تانتسنااك",
    "معاش فقتي":"مع الليل!",
    "غني ليا":"يا نكوي قلبي ميتين كية عشقها مادار فبا سايي ديكوتيت لي بغيتها دارت عليا ها حي عليا انا بروحي مليت جيسبيغ تكوني غابة ماشي كيما كنتي معايا جيسبيغ ماتكونيش مغبونة تكوني بيان ماشي محكورة جيسبيغ انا جيسبيغ",
    "الوداع":"تهلا !",
    "شنو كتعرف دير":"كلشي",
    "شكون صايبك":"واحد الحمقة سميتها هاجر",
    "شكرا":"هدا واجب",
    "كيفاش ":"كي المشماش لي طاب و ماحلاش ",
    "كتبغيني":"بزاف",
    "حبيبي":"وي حبي ",
    "توحشتك":"حتى انا توحشتك",
    "فين":"بخير",
    "فين بخير":"حسن منك",
    "كنسول فك":"العز",
    "كتعرفني":"لا ولكن غنولي نعرفك",
    "شخبارك":"كلشي مزيان",
    "كبيدة":"كتعنب عليا",
    "العمر":"ديالك انا",
    "الله يسر":"لينا و ليك",
    "الله يعاونك":"و يعاونك",
    "عندك فيسبوك":"لا",
    "مزيان الله يوفقك":"امييييين",
    "اشمن مدينة انت":"انا توال هوك",
    "الله يكبر بيك":"و بيك",
    "حبي":"عمري",
    "عويناتي":"نعطيهم لك",
    "الحمد لله":"و الشكر لله",
    "اللهم يسر":"اميييين",
    "وايلي":"وايييييه",
    "ههه":"هههههههه",
    "واش انت مصطي":"لهلا يحييك",
    "صباح الخير":"صباح الورد",
    "صباح النور":"صباح الياسمين",
    "حشومة":"حشومة هي مرت الشيطان",
    "مساء الخير":"مساء النور",
    "مساء النور":"مساء الخير",
    "شنو كادير":"كنهظر معاك اراس الطارو",
    "بخير":"اللهم لك الحمد",


   
    "Hello":"Hi , Whats Up",
    "Hello":"Hi , Whats Up",
    "Hello":"Hi , Whats Up",
    "Hello":"Hi , Whats Up",
    "Hello":"Hi , Whats Up",
    "Hello":"Hi , Whats Up",
    "Hello":"Hi , Whats Up",
    "Hello":"Hi , Whats Up",
    "Hello":"Hi , Whats Up",
    "Hello":"Hi , Whats Up",
    "Hello":"Hi , Whats Up",
    "Hello":"Hi , Whats Up",
    "Hello":"Hi , Whats Up",
    "Hello":"Hi , Whats Up",
};
function talk(){
    var user = document.getElementById('userBox').value;
    let chatareaouter = document.querySelector('.chatarea-outer');
    chatbotmsg = 'ما فهمتكش ؟؟';

    document.getElementById('userBox').value = "";
    let output = '';
        output += `<div class="chatarea-inner user">${user}</div>`;
        chatareaouter.innerHTML += output;



    if(user in know){
        let output = '';
        output += `<div class="chatarea-inner chatbot">${know[user]}</div>`;
        chatareaouter.innerHTML += output;

    }else{
        let output = '';
        output += `<div class="chatarea-inner chatbot">${chatbotmsg}</div>`;
        chatareaouter.innerHTML += output;

    }
}
